[
   {
      "id":1,
      "category":"Furniture and Decor",
      "postDate":"2023-05-14",
      "price":9.99,
      "title":"Garden Bench",
      "body":"Enhance your outdoor space with this stylish garden bench. Crafted from high-quality materials, it offers both comfort and durability for your garden or patio. Ideal for relaxing and enjoying the outdoors.",
      "published":true
   },
   {
      "id":2,
      "category":"Furniture and Decor",
      "postDate":"2023-05-15",
      "price":19.99,
      "title":"Outdoor Grill",
      "body":"Elevate your barbecue experience with this top-notch outdoor grill. Featuring multiple burners and a spacious grilling area, it's perfect for hosting summer gatherings and grilling up delicious meals.",
      "published":true
   },
   {
      "id":3,
      "category":"Gadgets and Tech",
      "postDate":"2023-05-16",
      "price":439.99,
      "title":"Latest Gaming Console",
      "body":"Get ready for next-level gaming with the latest console, offering incredible graphics, fast load times, and a wide range of exclusive games. The perfect choice for any gaming enthusiast.",
      "published":true
   },
   {
      "id":4,
      "category":"Gadgets and Tech",
      "postDate":"2023-05-17",
      "price":459.99,
      "title":"High-End Gaming Laptop",
      "body":"Experience the power and performance of a high-end gaming laptop. Equipped with cutting-edge hardware, it delivers exceptional speed and graphics for an immersive gaming experience on the go.",
      "published":true
   },
   {
      "id":5,
      "category":"Apparel and Accessories",
      "postDate":"2023-05-18",
      "price":39.99,
      "title":"Stylish T-Shirt",
      "body":"Update your wardrobe with this stylish T-shirt. Made from soft, breathable fabric, it combines comfort with a contemporary design. Available in various colors to suit your personal style.",
      "published":true
   },
   {
      "id":6,
      "category":"Apparel and Accessories",
      "postDate":"2023-05-19",
      "price":29.99,
      "title":"Casual Shorts",
      "body":"Perfect for warm weather, these casual shorts offer a relaxed fit and comfortable wear. Made from lightweight material, they are ideal for casual outings, workouts, or lounging at home.",
      "published":true
   },
   {
      "id":7,
      "category":"Fitness and Recreation",
      "postDate":"2023-05-20",
      "price":19.99,
      "title":"Baseball Glove",
      "body":"Gear up for the game with this durable baseball glove. Designed for optimal grip and flexibility, it’s perfect for players of all skill levels. Enjoy better performance and comfort on the field.",
      "published":true
   },
   {
      "id":8,
      "category":"Fitness and Recreation",
      "postDate":"2023-05-21",
      "price":99.99,
      "title":"Professional Soccer Ball",
      "body":"Take your soccer game to the next level with this professional-grade soccer ball. Designed for superior control and durability, it's perfect for training and matches alike.",
      "published":true
   },
   {
      "id":9,
      "category":"Animal Care",
      "postDate":"2023-05-16",
      "price":99.99,
      "title":"Premium Dog Food",
      "body":"Keep your dog healthy and happy with our premium dog food. Formulated with high-quality ingredients to provide balanced nutrition, it supports overall well-being and energy levels.",
      "published":true
   },
   {
      "id":10,
      "category":"Animal Care",
      "postDate":"2023-05-16",
      "price":9.99,
      "title":"Fish Food Flakes",
      "body":"Ensure your fish thrive with our high-quality fish food flakes. Packed with essential nutrients, it promotes healthy growth and vibrant colors, making it a great choice for any aquatic pet.",
      "published":true
   }
]
